"""
Дополнительные задания:
Напишите программу, которая найдёт произведение пар чисел списка.
Парой считаем первый и последний элемент, второй и предпоследний и т.д.
Пример:
[2, 3, 4, 5, 6] => [12, 15, 16];
[2, 3, 5, 6] => [12, 15]
"""
user_list = [2, 3, 4, 5, 6]
new_list = []
for index in range((len(user_list) + 1) // 2):
    new_list.append(user_list[index] * user_list[-index - 1])
print(f'Произведение пар чисел списка {user_list} равно {new_list}')
